tap "derailed/k9s"
tap "grafana/grafana"
tap "homebrew/services"
tap "idoavrah/homebrew"
tap "metalbear-co/mirrord"
brew "asdf"
brew "chezmoi"
brew "atuin", restart_service: :changed
brew "aws-iam-authenticator"
brew "awscli"
brew "bat"
brew "commitizen"
brew "coreutils"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "git-cliff"
brew "git-lfs"
brew "stern"
brew "gnu-sed"
brew "go"
brew "grep"
brew "grpcurl"
brew "helm"
brew "jq"
brew "k2tf"
brew "k9s"
brew "krew"
brew "kubectx"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "minikube"
brew "mkcert"
brew "nvm"
brew "p7zip"
brew "postgresql"
brew "prometheus"
brew "protobuf"
brew "pwgen"
brew "pyenv"
brew "rsync"
brew "temporal"
brew "terraform-docs"
brew "tfenv"
brew "tree"
brew "vim"
brew "wget"
brew "yamllint"
brew "zoxide"
brew "zsh"
cask "docker"
cask "visual-studio-code"
cask "wezterm"
cask "font-meslo-lg-nerd-font"  # required for Powerlevel10k icons
brew "grafana/grafana/cortextool"
brew "idoavrah/homebrew/tftui"
brew "metalbear-co/mirrord/mirrord"
vscode "anthropic.claude-code"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "kj.sqltools-driver-redshift"
vscode "mechatroner.rainbow-csv"
vscode "mellowmarshmallow.groovy"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "ue.alphabetical-sorter"
vscode "ventura.prom"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "redhat.vscode-yaml"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "honnef.co/go/tools/cmd/staticcheck"
