anthropic.claude-code
cweijan.dbclient-jdbc
cweijan.vscode-database-client2
dbaeumer.vscode-eslint
docker.docker
eamodio.gitlens
esbenp.prettier-vscode
github.copilot-chat
github.vscode-github-actions
golang.go
hashicorp.terraform
mechatroner.rainbow-csv
mellowmarshmallow.groovy
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.autopep8
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
ms-vsliveshare.vsliveshare
mtxr.sqltools
mtxr.sqltools-driver-pg
sdras.night-owl
streetsidesoftware.code-spell-checker
ue.alphabetical-sorter
ventura.prom
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscode-icons-team.vscode-icons
vue.volar
ms-kubernetes-tools.vscode-kubernetes-tools
redhat.vscode-yaml
